#ifndef MID_COUNTDOWN_H
#define MID_COUNTDOWN_H

#include "platform_common.h"

typedef struct 
{
    uint8  hour;
    uint8  min;
    uint8  sec;
    uint32 us;
}countdown_time_s;

typedef enum
{
    COUNTDOWN_NONE_MSG,     //无效的消息
    COUNTDOWN_DONE_MSG,     //倒计时完成消息
    COUNTDOWN_SEC_MSG,      //倒计时一秒计时完成消息
    COUNTDOWN_HALFSEC_MSG,  //相比COUNTDOWN_SEC_MSG延时半秒，倒计时完成消息
}MidCountDown_Msg;

typedef void (*mid_countdown_cb)(MidCountDown_Msg msg);

//**********************************************************************
// 函数功能: 倒计时复位，复位后为10小时倒计时
// 输入参数：无 
// 返回参数：无 
//**********************************************************************
extern void Mid_Countdown_Reset(void);

//**********************************************************************
// 函数功能: 倒计时初始化,硬件初始化，并注册中断回调函数
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_Init(void);

//**********************************************************************
// 函数功能: 设置callback，倒计时消息，倒计时完成后，上层需要进行什么操作
// 输入参数：countdown_cb
// 返回参数：无   
//**********************************************************************
extern void Mid_Countdown_SetCallBack(mid_countdown_cb countdown_cb);

//**********************************************************************
// 函数功能: 倒计时开始
// 输入参数：无  
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_Start(void);

//**********************************************************************
// 函数功能: 倒计时停止
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_Stop(void);

//**********************************************************************
// 函数功能: 读取倒计时剩余时间
// 输入参数：timeTemp：传入变量，保存倒计时剩余时间
// 返回参数：无 
//**********************************************************************
extern void Mid_Countdown_TimeRead(countdown_time_s *timeTemp);

//**********************************************************************
// 函数功能: 设置/写入倒计时剩余时间
// 输入参数：timeTemp：传入倒计时剩余时间参数
//        
// 返回参数：无  
//**********************************************************************
extern void Mid_Countdown_TimeWrite(countdown_time_s *timeTemp);

//**********************************************************************
// 函数功能: 循环设置倒计时小时部分的十位数加
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighHourAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时小时部分的十位数减
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighHourLess(void);

//**********************************************************************
// 函数功能: 循环设置倒计时小时部分的个位数加
// 输入参数：无
// 返回参数：无 
//**********************************************************************
extern void Mid_Countdown_LowHourAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时小时部分的个位数减
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_LowHourLess(void);

//**********************************************************************
// 函数功能: 循环设置倒计时分钟部分的十位数加
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighMinAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时分钟部分的十位数减
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighMinLess(void);

//**********************************************************************
// 函数功能: 循环设置倒计时分钟部分的个位数加
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_LowMinAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时分钟部分的个位数减
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_LowMinLess(void);

//**********************************************************************
// 函数功能: 循环设置倒计时秒钟部分的十位数加
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighSecAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时秒钟部分的十位数减
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_HighSecLess(void);

//**********************************************************************
// 函数功能: 循环设置倒计时秒钟部分的个位数加
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_LowSecAdd(void);

//**********************************************************************
// 函数功能: 循环设置倒计时秒钟部分的个位数减
// 输入参数：无   
// 返回参数：无
//**********************************************************************
extern void Mid_Countdown_LowSecLess(void);
#endif // COUNTDOWN_APP_H

