#ifndef MID_STOPWATCH_H
#define MID_STOPWATCH_H

#include "platform_common.h"

typedef struct 
{
	uint8   hour;
	uint8   min;
	uint8   sec;
	uint32	us;
}stopwatch_time_s;

typedef enum
{
    STOPWATCH_NONE_MSG,     //无效的消息
    STOPWATCH_32Hz_MSG,     //32Hz中断消息
    STOPWATCH_SEC_MSG,      //一秒中断消息
    STOPWATCH_HALFSEC_MSG,  //半秒中断消息
}MidStopWatch_Msg;

typedef void (*mid_stopwatch_cb)(MidStopWatch_Msg msg);

//**********************************************************************
// 函数功能: 秒表复位函数
//       对秒表参数全部复位为0，对秒表Timer进行硬件服务
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_Reset(void);

//**********************************************************************
// 函数功能: 秒表功能初始化函数。
//       对秒表Timer进行硬件进行初始化，并注册中断回调函数，对秒表参数复位
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_Init(void);

//**********************************************************************
// 函数功能: 设置callback，倒计时消息，倒计时完成后，上层需要进行什么操作
// 输入参数：countdown_cb
// 返回参数：无   
//**********************************************************************
extern void Mid_StopWatch_SetCallBack(mid_stopwatch_cb stopwatch_cb);

//**********************************************************************
// 函数功能:  启动秒表函数
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_Start(void);

//**********************************************************************
// 函数功能:  暂停秒表函数
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_Stop(void);

//**********************************************************************
// 函数功能: 读取秒表时间函数，带us补偿
//           把秒表时间读取出来，带us补偿
// 输入参数：timeTemp：传入变量，保存秒表的时间
// 返回参数：    
//**********************************************************************
extern void Mid_StopWatch_CountRead(stopwatch_time_s *timeTemp);

//**********************************************************************
// 函数功能: 读取秒表时间，不带us补偿
//       把秒表时间读取出来
// 输入参数：timeTemp：传入变量，保存秒表的时间   
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_TimeRead(stopwatch_time_s *timeTemp);

//**********************************************************************
// 函数功能: 计算（timeTemp2-timeTemp1）的时差，精确到us
// 输入参数：   
//        timeTemp1:单圈时间1
//        timeTemp2:单圈时间2
// 返回参数：difftime：（timeTemp2-timeTemp1）的时差
//**********************************************************************
extern stopwatch_time_s Mid_StopWatch_DiffLapTime(stopwatch_time_s *timeTemp1, stopwatch_time_s *timeTemp2);

//**********************************************************************
// 函数功能: 计算秒表单圈 时间的平均值
//           calculate average value of all lap time
// 输入参数：*lapAvg：传入变量指针，保存单圈时间的平均值
// 返回参数：无 
//**********************************************************************
extern void Mid_StopWatch_LapGetAvg(stopwatch_time_s *lapAvg);

//**********************************************************************
// 函数功能: 单圈时间数组里面，算出单圈时间数组里的最值位置
//           find the pos of max and min lap
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_LapGetMaxMin(void);

//**********************************************************************
// 函数功能:  将此次单圈时间存入单圈时间结构体数组，并算出单圈时间的最值
//  set a new lap, calculate average value, find the pos of max and min lap
// 输入参数：无
// 返回参数：无
//**********************************************************************
extern void Mid_StopWatch_SetLap(void);

//**********************************************************************
// 函数功能:  读取最大单圈时间的位置
// 输入参数： 无
// 返回参数： maxLapPos：最大单圈时间的位置
//**********************************************************************
extern uint8 Mid_StopWatch_ReadLapMax(void);

//**********************************************************************
// 函数功能:  读取最小单圈时间的位置
// 输入参数： 无   
// 返回参数：minLapPos ：最小单圈时间的位置
//**********************************************************************
extern uint8 Mid_StopWatch_ReadLapMin(void);

//**********************************************************************
// 函数功能:  读取平均单圈时间函数
// 输入参数： 无 
// 返回参数：stopwatchLapAvg：平均单圈时间的结构体变量。
//**********************************************************************
extern stopwatch_time_s *Mid_StopWatch_ReadLapAvg(void);

//**********************************************************************
// 函数功能: 读取所取单圈时间次数函数
// 输入参数：无
// 返回参数：stopwatchLapCnt：单圈计数
//**********************************************************************
extern uint8 Mid_StopWatch_ReadLapCnt(void);

//**********************************************************************
// 函数功能:  读取单圈时间函数
// 输入参数： 无
// 返回参数：stopwatchLapTime：单圈时间
//**********************************************************************
extern stopwatch_time_s *Mid_StopWatch_ReadLapTime(void);
#endif			//	STOPWATCH_APP_H
