#ifndef PLATFORM_FEATURE_H
#define PLATFORM_FEATURE_H

/****************************************************************************************
**                            软件功能开关
**
**此文件定义:软件功能开关，需要的功能将对应的宏设置为1，不用的功能就设置为0
**目的:可以通过一个文件来管理整个软件的功能可用与否，而不需要在某个模块.c中配置或临时用#if 0
**      /#if 1的方式
**
****************************************************************************************/

/****************************************************************************************
**
**功能: 单元测试模块开关
**       
****************************************************************************************/
#define MODULE_TEST_ENABLE     1

/****************************************************************************************
**
**功能 0-0: 定义客户名称
**       
****************************************************************************************/
#define H003_CUS_PUBLIC    0 //公版
#define H003_CUS_LENOVO    1 //联想

#define H003_CUS_TYPE      H003_CUS_PUBLIC

/****************************************************************************************
**
**功能 0-1:定义是否带气压，宏设置为1---带气压；为0----不带气压
**
**说明: 客户名称和是否带气压，项目编号不一样
**
****************************************************************************************/
#define AIR_PRESSURE_SUPPORT          0

#if(H003_CUS_TYPE == H003_CUS_LENOVO)
//项目编号，5个字符
//带气压
#if(AIR_PRESSURE_SUPPORT == 1)
#define PROJECT_ID             'P','C','0','0','1'
#define BLE_ADV_LOCALNAME_LEN  11
#define BLE_ADV_LOCALNAME      'W','a','t','c','h',' ','X','P','l','u','s'
#else
//不带气压
#define PROJECT_ID             'P','B','0','0','1'
#define BLE_ADV_LOCALNAME_LEN  7
#define BLE_ADV_LOCALNAME      'W','a','t','c','h',' ','X'
#endif

#else       //公版，项目编号

//项目编号，5个字符
//带气压
#if(AIR_PRESSURE_SUPPORT == 1)
#define PROJECT_ID             'P','C','0','0','0'
#define BLE_ADV_LOCALNAME_LEN  5
#define BLE_ADV_LOCALNAME      'H','0','0','3','A'
#else
//不带气压
#define PROJECT_ID             'P','B','0','0','0'
#define BLE_ADV_LOCALNAME_LEN  4
#define BLE_ADV_LOCALNAME      'H','0','0','3'
#endif
#endif

/****************************************************************************************
**
**功能 1:EM9304 FW是否要跑在EM9304 OTP里，在OTP中运行，EM9304功耗可降50uA。
**       成表正式版本软件，为了降功耗，必须将此宏设置为1
**
****************************************************************************************/
#define EM9304FW_RUN_IN_OTP           0

/****************************************************************************************
**
**功能 2:蓝牙配对--机芯显示pin码，手机输入PIN码，才正常连接
**
****************************************************************************************/
#define BLE_PASSKEY_PAIRNG_ENABLE     0

#endif

