#ifndef __SM_FLASE_H
#define __SM_FLASE_H

#include "platform_common.h"

//**********************************************************************
// 函数功能: init Flash
// 输入参数： 
// 返回参数: flash size
//**********************************************************************
extern uint32 SMDrv_Flash_Init(void);

//**********************************************************************
// 函数功能: deinit Flash
// 输入参数： 
// 返回参数: flash size
//**********************************************************************
extern uint32 SMDrv_Flash_DeInit(void);

//**********************************************************************
// 函数功能: enable Flash
// 输入参数： 
// 返回参数: flash size
//**********************************************************************
extern uint32 SMDrv_Flash_Enable(void);

//**********************************************************************
// 函数功能: Disable Flash
// 输入参数： 
// 返回参数: 
//**********************************************************************
extern uint32 SMDrv_Flash_Disable(void);

//**********************************************************************
// 函数功能: 获取internal Flash总大小
// 输入参数： 
// 返回参数: flash size
//**********************************************************************
extern uint32 SMDrv_Flash_GetTotalSize(void);

//**********************************************************************
// 函数功能: 获取internal Flash Page size
// 输入参数： 
// 返回参数: flash Page size
//**********************************************************************
extern uint32 SMDrv_Flash_GetPageSize(void);

//**********************************************************************
// 函数功能: 获取internal Flash Sector size
// 输入参数： 
// 返回参数: flash Sector size
//**********************************************************************
extern uint32 SMDrv_Flash_GetSectorSize(void);

//**********************************************************************
// 函数功能: 擦除flash一块page区域
// 输入参数：ui32Addr:要擦除的page区域起始地址 
// 返回参数: 
// 说    明:该接口将擦除整个page内容
//**********************************************************************
extern void SMDrv_Flash_ErasePage(uint32 ui32Addr);

//**********************************************************************
// 函数功能: 擦除flash一块sector区域
// 输入参数：ui32Addr:要擦除的sector区域起始地址 
// 返回参数: 
// 说    明:该接口将擦除整个sector内容
//**********************************************************************
extern void SMDrv_Flash_EraseSector(uint32 ui32Addr);

//**********************************************************************
// 函数功能: 将pu32Buffer数据写到flash page区域
// 输入参数：ui32WriteAddr:要写的page区域起始地址
//           pu32Buffer/numBytes:要写的数据，及数据大小
// 返回参数: 
// 说    明:该接口写flash最小单位是一个page
//**********************************************************************
extern void SMDrv_Flash_ProgramPage(uint32 ui32WriteAddr,uint32 *pu32Buffer, uint32 numBytes);

#ifdef AM_PART_APOLLO3
//**********************************************************************
// 函数功能: 增加一个image用来OTA
// 输入参数：imageMagic:image magic
//           pImage:指向image
// 返回参数: 
//**********************************************************************
extern void SMDrv_OTA_Add(uint8 imageMagic, uint32 *pImage);

//**********************************************************************
// 函数功能: Initialize OTA state
// 输入参数：pOtaDesc:should be start of a flash page designated for OTA Descriptor
// 返回参数: 
//**********************************************************************
extern void SMDrv_OTA_Init(uint32_t *pOtaDesc);
#endif

#endif
