#ifndef __SM_SWSPI_H
#define __SM_SWSPI_H

#include "platform_common.h"

//**********************************************************************
// 函数功能: open一组io口作模拟spi
// 输入参数：	
// 返回参数：
//**********************************************************************
extern ret_type SMDrv_SWSPI_Open(void);

//**********************************************************************
// 函数功能: close swspi io
// 输入参数：	
// 返回参数：
//**********************************************************************
extern ret_type SMDrv_SWSPI_Close(void);

//**********************************************************************
// 函数功能: 写一个byte数据
// 输入参数：byte:要写的数据	
// 返回参数：
//**********************************************************************
extern ret_type SMDrv_SWSPI_WriteByte(uint8 byte);

//**********************************************************************
// 函数功能: 读一个byte数据
// 输入参数：	
// 返回参数：
//**********************************************************************
extern uint8 SMDrv_SWSPI_ReadByte(void);

//**********************************************************************
// 函数功能: 写length bytes数据
// 输入参数：pdata:要写的数据，	length:数据长度
// 返回参数：
//**********************************************************************
extern ret_type SMDrv_SWSPI_WriteBytes(uint8* pdata,uint16 length);

//**********************************************************************
// 函数功能: 读length bytes数据
// 输入参数：pdata:数据buffer，	length:要读数据长度
// 返回参数：
//**********************************************************************
extern ret_type SMDrv_SWSPI_ReadBytes(uint8_t* pdata,uint16_t length);
#endif

